PureEngineering/PUREmodules/nrf52/modules_examples/soil_detector_ble/main.c
  config_word_lsb = 0x04;
  config_word_msb = 0x00;

  write_2bytes(twi_master,FDC2214_DEVICE_ADDRESS,FDC2214_SETTLECOUNT_CH0,config_word_lsb,config_word_msb);
  write_2bytes(twi_master,FDC2214_DEVICE_ADDRESS,FDC2214_SETTLECOUNT_CH1,config_word_lsb,config_word_msb);
  write_2bytes(twi_master,FDC2214_DEVICE_ADDRESS,FDC2214_SETTLECOUNT_CH2,config_word_lsb,config_word_msb);
  write_2bytes(twi_master,FDC2214_DEVICE_ADDRESS,FDC2214_SETTLECOUNT_CH3,config_word_lsb,config_word_msb);

  config_word_lsb = 0x10;
  config_word_msb = 0x01;

  write_2bytes(twi_master,FDC2214_DEVICE_ADDRESS,FDC2214_CLOCK_DIVIDERS_CH0,config_word_lsb,config_word_msb);
  write_2bytes(twi_master,FDC2214_DEVICE_ADDRESS,FDC2214_CLOCK_DIVIDERS_CH1,config_word_lsb,config_word_msb);
  write_2bytes(twi_master,FDC2214_DEVICE_ADDRESS,FDC2214_CLOCK_DIVIDERS_CH2,config_word_lsb,config_word_msb);
  write_2bytes(twi_master,FDC2214_DEVICE_ADDRESS,FDC2214_CLOCK_DIVIDERS_CH3,config_word_lsb,config_word_msb);
  
  //set driven current, value 0x7C00
  config_word_lsb = 0x7C;
  config_word_msb = 0x00; 
  
  write_2bytes(twi_master,FDC2214_DEVICE_ADDRESS,FDC2214_DRIVE_CURRENT_CH0,config_word_lsb,config_word_msb);
  write_2bytes(twi_master,FDC2214_DEVICE_ADDRESS,FDC2214_DRIVE_CURRENT_CH1,config_word_lsb,config_word_msb);
  write_2bytes(twi_master,FDC2214_DEVICE_ADDRESS,FDC2214_DRIVE_CURRENT_CH2,config_word_lsb,config_word_msb);
 
  config_word_lsb = 0x00;
  config_word_msb = 0x01;
  write_2bytes(twi_master,FDC2214_DEVICE_ADDRESS,FDC2214_ERROR_CONFIG,config_word_lsb,config_word_msb);

  config_word_lsb = 0xA2;
  config_word_msb = 0x0C;
  write_2bytes(twi_master,FDC2214_DEVICE_ADDRESS,FDC2214_MUX_CONFIG,config_word_lsb,config_word_msb);
  
  config_word_lsb = 0x1E;
  config_word_msb = 0x01;
  write_2bytes(twi_master,FDC2214_DEVICE_ADDRESS,FDC2214_CONFIG,config_word_lsb,config_word_msb);
  

  return fdc2214_whoami(twi_master);
}
// start the timer to transmit data to a phone when the fdc2214 connects to a phone
// it stop transmitting data when it is disconnected
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;

    /* Initializing TWI master interface for SuperSensor */
    err_code = twi_master_init();
    APP_ERROR_CHECK(err_code);

    APP_ERROR_CHECK(NRF_LOG_INIT(NULL));

    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    bsp_board_leds_init();
	fdc2214_init(m_twi_master);


	NRF_LOG_RAW_INFO("UART Start!------->\n\r");  NRF_LOG_FLUSH();
	err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
	
	
  

  //  create_sensor_timer();

    // Enter main loop.
    for (;;)
    {
		//NRF_LOG_RAW_INFO("UART Start!------->\n\r");
		//SEGGER_RTT_TerminalOut(1, "Hello World!\n");
		// bool passed_test = fdc2214_pass(m_twi_master);
		// if(passed_test){
			// uint16_t status = run_fdc2214(m_twi_master);
			// NRF_LOG_RAW_INFO("fdc2214 pass ");
			// NRF_LOG_FLUSH();
			
		// }
		// else{
			// NRF_LOG_RAW_INFO("fdc2214 failed\n");NRF_LOG_FLUSH();
		//	purehealth_allpass = false;
		// }
		
		NRF_LOG_FLUSH(); 
		err_code = sd_app_evt_wait();
		APP_ERROR_CHECK(err_code);
	
    }
	
}


/**
 * @}
 */
